perf/scenarios/metar.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Light Plain 
      duration: 120
      arrivalRate: 1
    - name: Light Ramp
      duration: 60
      arrivalRate: 1 
      rampTo: 10
    - name: Intermediate Plain
      duration: 120
      arrivalRate: 10 
    - name: Heavy Ramp
      duration: 60
      arrivalRate: 10
      rampTo: 35
    - name: Heavy Plain
      duration: 120
      arrivalRate: 35
    - name: Extreme Ramp
      duration: 60
      arrivalRate: 35
      rampTo: 75
    - name: Extreme Plain
      duration: 120
      arrivalRate: 75

scenarios:
  - name: Metar (/)
    flow:
      - get:
          url: '/Metar'