perf/scenarios/spaceflight_news.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Light Plain 
      duration: 120
      arrivalRate: 1
    - name: Light Ramp
      duration: 60
      arrivalRate: 1 
      rampTo: 15
    - name: Intermediate Plain
      duration: 120
      arrivalRate: 15 
    - name: Heavy Ramp
      duration: 60
      arrivalRate: 15
      rampTo: 45
    - name: Heavy Plain
      duration: 120
      arrivalRate: 45
    - name: Extreme Ramp
      duration: 60
      arrivalRate: 45
      rampTo: 100
    - name: Extreme Plain
      duration: 120
      arrivalRate: 100

scenarios:
  - name: SpaceFlight (/)
    flow:
      - get:
          url: '/SpaceFlight'